readme.md

# Table of Contents

1.  [Python presentations & slides](#org890acc3)
    1.  [What is this repository?](#orgaf38d1e)
    2.  [Where's the solutions to the exercises?](#org3b5efee)
    3.  [May I use this repository?](#org88a8581)
    4.  [May I contribute to this repository?](#orgad5bbd9)
    5.  [What's included](#org4e9b90c)
        1.  [Lectures & Slides <code>[22%]</code>](#orgee3be34)


<a id="org890acc3"></a>

# Python presentations & slides


<a id="orgaf38d1e"></a>

## What is this repository?

This is a repository that contains python lectures, slides & exercises for my Python basics course modules. You may either view them using [Jupyter Notebook](http://jupyter.org/) or by simply opening the corresponding slides.html within each folder. It's purpose is to guide a lecture on the basics of Python and provide context & examples.


<a id="org3b5efee"></a>

## Where's the solutions to the exercises?

They will be in a separate repository and made available after this repository is more or less complete.


<a id="org88a8581"></a>

## May I use this repository?

You are 100% free to use, fork, change and reproduce this content. All I ask for is the occassional plug.

If you want to use these slides with all of their interactive glory in Jupyter Notebook, you will need to use the [RISE](https://github.com/damianavila/RISE) extension. Both Jupyter Nodebook and RISE can be installed by following directions for various Linux distros or your other OS of choice (Mac/Windows).


<a id="orgad5bbd9"></a>

## May I contribute to this repository?

You may, though, keep in mind that I have a set order for these course modules. I will need to merge changes at my discretion.


<a id="org4e9b90c"></a>

## What's included

Also note this repository is a <span class="underline">work in progress</span>. I am building and refining it as I go. Check back or perform a \`git pull\` periodically to get updates.


<a id="orgee3be34"></a>

### TODO Lectures & Slides <code>[22%]</code>

-   [ ] How to get the most out these modules
-   [x] [What is Python](./introduction)?
-   [ ] Data Types & Variables
-   [ ] Iterables (lists, dictionaries, tuples, iterating, slicing, built ins)
-   [ ] Control Flow (looping, operators, try/exception blocks)
-   [x] [Functions](./functions) (basics, lambdas, closures, decorators)
-   [ ] The Standard Library <code>[0/2]</code>
    -   [ ] What's in the Library (where to learn more)
    -   [ ] File Management (os/shutil) - The standard library by example
-   [ ] Object Oriented Python (classes, constructors, methods, inheritance)
-   [ ] Package Management (using pip, using packages, writing your own)

